[
    {
        "title": "BMW XM",
        "img": "https://static1.hotcarsimages.com/wordpress/wp-content/uploads/2023/06/2023-bmw-xm-1500x750.jpg?q=50&fit=crop&w=750&dpr=1.5",
        "price": "$159,000",
        "brand": "BMW",
        "description": "All-new for 2023, the BMW XM is a high-performance, full-size, plug-in hybrid (PHEV) luxury crossover SUV, and it is only the 2nd Bimmer that was solely developed by the German carmaker's M division (after the 1978 BMW M1). Currently, the 2023 BMW XM combines the power of a 4.4-liter twin-turbo V8 block (483 hp, 479 lb-ft of torque) with that of a potent, transmission-integrated electric motor to produce a massive system output of 644 hp and 590 lb-ft of twist. As if these figures weren't impressive enough, the more stylish and more powerful BMW XM Label Red is on the horizon. With a total system output of 738 hp and 738 lb-ft of torque, the BMW XM Label Red will sprint from 0 to 60 mph in just 3.7 seconds.The 2023 BMW XM has yet to receive a quality and reliability score from JD Power, but the new Bimmer SUV earned a 4.0/5 rating from KBB's expert reviews and a 7.7/10 verdict from Edmunds."
    },
    {
        "title": "Chevrolet Corvette C8",
        "img": "https://static1.hotcarsimages.com/wordpress/wp-content/uploads/2023/06/2023-chevrolet-corvette_z06-1500x750.jpg?q=50&fit=crop&w=750&dpr=1.5",
        "price": "$106,695",
        "brand": "Chevrolet",
        "description": "Since its launch in 2020, the 8th-generation (C8) Chevrolet Corvette has received plenty of praise due to its ability to match the power and handling of much pricier sports cars. This 2023, Chevrolet launched the more potent Corvette Z06 – not as a performance package, but as a trim by itself. The 2023 Chevy Corvette C8 Z06 is America's first mid-engine Z06, and its 5.5-liter flat-plane crank V8 (670 hp, 460 lb-ft) is one of the most powerful naturally-aspirated production V8 engines in the world today. From a standstill, the 2023 Chevrolet Corvette Z06 can dash to 60 mph in just 2.6 seconds, making it a match not just for more expensive sports cars, but for top-dollar supercars as well. The 2023 Chevrolet Corvette earned a best 93/100 quality and reliability score from JD Power, a great 8.5/10 verdict from Edmunds, and a laudable 4.7/5 rating from KBB's expert reviews."
    },
    {
        "title": "Dodge Hornet",
        "img": "https://static1.hotcarsimages.com/wordpress/wp-content/uploads/2023/06/2023-dodge-hornet-1500x750.jpg?q=50&fit=crop&w=750&dpr=1.5",
        "price": "$30,735",
        "brand": "Dodge",
        "description": "The all-new 2023 Dodge Hornet is a performance-oriented, AWD small crossover that toes the line between the sub-compact and compact SUV classes. As the first new Dodge nameplate in over 10 years, the AWD 2023 Hornet joins the veteran Durango to help Dodge make a bigger mark in the huge and highly-competitive SUV segment. Powering the 2023 Dodge Hornet's gasoline GT trims is a turbocharged 2.0-liter, 4-cylinder engine (268 hp and 295 lb-ft of torque), while the R/T variants (available by summer 2023) will use a plug-in hybrid powertrain that will generate 288 hp. The 2023 Dodge Hornet hasn't received a quality and reliability score from JD Power, but it has earned a 4.0/5 expert review rating from KBB and a 5/5 consumer review score from Edmunds. Take note, however, that more consumer reviews are needed for new models to have a more reliable average rating."
    },
    {
        "title": "Honda CR-V",
        "img": "https://static1.hotcarsimages.com/wordpress/wp-content/uploads/2023/06/2023-honda-cr-v-1500x750.jpg?q=50&fit=crop&w=750&dpr=1.5",
        "price": "$29,500",
        "brand": "Honda",
        "description": "The 2024 Honda CR-V is the 2nd installment of the popular compact crossover SUV's 6th generation. For the 2024 model year, the Sport-L Hybrid trim joins the lineup, and as with existing hybrid variants, it derives 204 horses from a 2.0-liter I-4 engine paired with 2 electric motors. Gasoline trims, on the other hand, use a turbocharged 1.5-liter DOHC VTEC mill that produces 190 hp and 179 lb-ft of torque. The 2024 Honda CR-V is not as fun to drive as some performance-oriented SUVs. However, with a good balance of ride quality, tech features, and storage space, the 2024 Honda CR-V is still the benchmark compact SUV for American families."
    },
    {
        "title": "Kia Niro",
        "img": "https://static1.hotcarsimages.com/wordpress/wp-content/uploads/2023/06/2023-kia-niro-1500x750.jpg?q=50&fit=crop&w=750&dpr=1.5",
        "price": "$26,590",
        "brand": "Kia",
        "description": "For 2023, Kia gave the Niro hybrid small crossover SUV a full redesign, as well as new PHEV and fully electric variants in the model lineup. Aside from a fresh exterior look, the all-new 2023 Kia Niro came with a bigger cabin space, an updated infotainment system, and improved fuel economy from its 1.6-liter hybrid engine (139 hp, 195 lb-ft, up to 53 MPG). The 2023 Kia Niro PHEV, on the other hand, uses the same gasoline engine but gets a total of 180 hp, 195 lb-ft of torque, and a 33-mile all-electric driving range due to its electric motor and 11.1-kWh battery. Finally, the 2023 Kia Niro EV is an all-electric FWD crossover that gets 201 hp, 188 lb-ft of torque, a 253-mile driving range, and a 113-MPG equivalent from its single electric motor and 64.8-kWh drive battery. The 2023 Kia Niro hybrid models received an average 77/100 quality and reliability score from JD Power, a convincing 4.5/5 expert review score from KBB, and an 8.0/10 verdict from Edmunds. The all-electric 2023 Kia Niro didn't get ratings from JD Power and KBB, but it did receive an 8.2/10 Edmunds verdict – slightly higher than that of its hybrid stablemates."
    },
    {
        "title": "Lexus RZ",
        "img": "https://static1.hotcarsimages.com/wordpress/wp-content/uploads/2023/06/2023-lexus-rz_450e-1500x750.jpg?q=50&fit=crop&w=750&dpr=1.5",
        "price": "$59,650",
        "brand": "Lexus",
        "description": "The 2023 Lexus RZ and its mechanically-identical brother – the Toyota bZ4X – are the Japanese automotive group's first entries into the battery electric vehicle (BEV) arena. With its two electric motors and a 71.4-kWh traction battery, the electric-AWD Lexus RZ compact crossover gets a total system output of 308 hp, near-instantaneous torque (196.4 lb-ft at the front, 124.3 lb-ft at the rear), and up to 220 miles of driving range. With its standard configuration, the 2023 Lexus RZ 450e returns a 107-MPGe combined fuel economy rating. JD Power has yet to release its reliability ratings for the 2023 Lexus RZ, but KBB experts have given the all-electric Lexus a 4.1/5 rating and Edmunds has released its own 7.9/10 verdict."
    },
    {
        "title": "Mercedes-Benz EQE SUV",
        "img": "https://static1.hotcarsimages.com/wordpress/wp-content/uploads/2023/06/2023-mercedes-benz-eqe_suv-1500x750.jpg?q=50&fit=crop&w=750&dpr=1.5",
        "price": "$77,900",
        "brand": "Mercedes-Benz",
        "description": "The all-new 2023 Mercedes-Benz EQE SUV is a midsize luxury BEV crossover SUV. For all intents and purposes, the 2023 EQE SUV is the more utilitarian version of the Mercedes-Benz EQE sedan, which, in turn, is the all-electric version of the revered Mercedes-Benz E-Class midsize car. Currently, the base Mercedes-Benz EQE 350+ trim uses one electric motor and a 90.6-kWh battery to deliver 288 hp and 417 lb-ft of torque to the rear wheels. One step above is the EQE 350 4MATIC, which uses dual electric motors to get the same horsepower rating, but a more impressive 564 lb-ft torque rating and an e-AWD configuration. Finally, the EQE 500 4MATIC uses more powerful dual electric motors to provide all four wheels a combined output of 402 hp and 633 lb-ft. Depending on the trim level, the US-spec 2023 Mercedes-Benz EQE SUV has a driving range of 253 up to 279 miles on a full charge. The 2023 Mercedes-Benz EQE SUV has a perfect 5.0/5 from two consumer reviews from Edmunds, which, although good, is not yet sufficient for a well-informed assessment. JD Power and KBB have yet to release their ratings."
    },
    {
        "title": "Polestar 3",
        "img": "https://static1.hotcarsimages.com/wordpress/wp-content/uploads/2023/06/2024-polestar-3-1500x750.jpg?q=50&fit=crop&w=750&dpr=1.5",
        "price": "$83,900",
        "brand": "Polestar",
        "description": "The all-new 2024 Polestar 3 is an all-electric, 2-row crossover midsize SUV from the Volvo group. Primed for performance, both of the 2024 Polestar 3 trims use dual electric motors, AWD configuration, electric torque vectoring, and dual-chamber air suspension to blaze through straightaways and remain planted on curves. Using a 111-kWh traction battery, the base Polestar 3 trim gets 489 hp, 620 lb-ft of torque, a 4.9-second sprint time from 0 to 60 mph, and 300 miles of range. The Performance Pack trim, in turn, can achieve 517 hp, 671 lb-ft of torque, a 4.6-second dash from 0 to 60 mph, and 270 miles of driving range. The Polestar 3 was originally slotted for the 2023 model year, but the Volvo sub-brand postponed the commercial release for 2024. No ratings from KBB, Edmunds, or JD Power are available to date."
    },
    {
        "title": "Toyota Crown",
        "img": "https://static1.hotcarsimages.com/wordpress/wp-content/uploads/2023/06/2023-toyota-crown-studio-red-1500x750.jpg?q=50&fit=crop&w=750&dpr=1.5",
        "price": "$39,950",
        "brand": "Toyota",
        "description": "The all-new 2023 Toyota Crown replaces the Avalon after the latter's 27-year run as Toyota USA's flagship sedan. The 2023 Toyota Crown's build is quite unique, as it sports a body size and ride height that surpasses the midsize sedan class, but not enough to step into full-size sedan or crossover SUV territory. Nevertheless, Toyota justifies the 2023 Crown's premium status with posh interior appointments and technology features that knock on Lexus' doors. The 2023 Crown comes with two hybrid powertrain options, namely a 2.5-liter Dynamic Force engine (236 net hp, 41 MPG) and a 2.4-liter Hybrid Max engine that delivers 264 hp, 332 lb-ft of twist, and a 30-MPG fuel economy rating. All 2023 Toyota Crown trims come standard with AWD configuration. The 2023 Toyota Crown has yet to receive its JD Power reliability rating, but it already garnered a very decent 4.6/5 expert rating from KBB and a 4.9/5 score based on 12 consumer reviews from Edmunds."
    },
    {
        "title": "Toyota GR Corolla",
        "img": "https://static1.hotcarsimages.com/wordpress/wp-content/uploads/2023/06/2023-toyota-gr_corolla-1500x750.jpg?q=50&fit=crop&w=750&dpr=1.5",
        "price": "$35,900",
        "brand": "Toyota",
        "description": "Toyota's sub-compact hot hatch, the GR Yaris, is not available in the North American market. Hence, as an appropriate response to the Honda Civic Type R, Subaru WRX, Hyundai Elantra N, and Volkswagen Golf R, Toyota released the all-new 2023 Toyota GR Corolla based on the compact Corolla Hatchback. Using a turbocharged 1.6-liter, 3-cylinder engine (300 hp, 275-295 lb-ft) that redlines at 7,200 rpm, an AWD configuration, and Torsen front/rear limited slip differentials, the 6-speed, manual-transmission-only GR Corolla can sprint from 0 to 60 mph in just 4.9 seconds. Both KBB and JD Power have yet to release their assessment scores, but Edmunds already gave the 2023 GR Corolla an 8.0/10 verdict."
    }
]